





Network Working Group                    Internet Engineering Task Force
Internet-Draft                                              S. Alexander
                                                     INTERACTIVE Systems
                                                                R. Droms
                                                     Bucknell University
                                                           November 1992


                DHCP Options and BOOTP Vendor Extensions

Status of this Memo

   This document is an Internet Draft.  Internet Drafts are working
   documents of the Internet Engineering Task Force (IETF), its Areas,
   and its Working Groups. Note that other groups may also distribute
   working documents as Internet Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months. Internet Drafts may be updated, replaced, or obsoleted by
   other documents at any time.  It is not appropriate to use Internet
   Drafts as reference material or to cite them other than as a "working
   draft" or "work in progress."

   Please check the 1id-abstracts.txt listing contained in the
   internet-drafts Shadow Directories on nic.ddn.mil, nnsc.nsf.net,
   nic.nordu.net, ftp.nisc.sri.com, or munnari.oz.au to learn the
   current status of any Internet Draft.

   Distribution of this memo is unlimited.

Abstract

   The Dynamic Host Configuration Protocol (DHCP) [1] provides a
   framework for passing configuration information to hosts on a TCP/IP
   network.  Configuration parameters and other control information are
   carried in tagged data items that are stored in the "options" field
   of the DHCP message.  The data items themselves are also called
   "options."

   This document specifies the current set of DHCP options.  This
   document will be periodically updated as new options are defined.
   Each superseding document will include the entire current list of
   valid options.

Table of Contents

    1.  DHCP Option Fields ........................................  2



S. Alexander, R. Droms     Expires June 1993                    [Page 1]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


    2.  RFC 1084 Vendor Extensions ................................  2
    3.  IP Layer Parameters per Host ..............................  6
    4.  IP Layer Parameters per Interface .........................  9
    5.  Link Layer Parameters per Interface ....................... 11
    6.  TCP Parameters ............................................ 12
    7.  DHCP Extensions ........................................... 13
    8.  Security Considerations ................................... 16
    9.  References ................................................ 16
   10.  Authors' Address .......................................... 17

1. DHCP Option Fields

   DHCP options have the same format as the BOOTP "vendor extensions"
   defined in RFC 1084 [2].  Options may be fixed length or variable
   length.  All options begin with a tag octet, which uniquely
   identifies the option.  Fixed length options without data consist of
   only a tag octet.  For fixed length options with data, the data
   immediately follows the tag octet.  For variable length options, a
   length octet follows the tag octet.  The length octet is followed by
   length octets of data.

   All multi-octet quantities are in network byte-order.

   All of the "vendor extensions" defined in RFC 1084 are also DHCP
   options.

   Option codes 128 to 254 (decimal) are reserved for site-specific
   options.

   Except for the options in section 7, all options may be used with
   either DHCP or BOOTP.

   Many of these options may have default values specified in other
   documents.  In particular, RFC 1122 [3] specifies default values for
   many aspects of IP and TCP behavior.

2. RFC 1084 Vendor Extensions

   This section lists the vendor extensions as defined in RFC 1084.
   They are defined here for completeness.

   2.1. Pad Option

   The pad option can be used to cause subsequent fields to align on
   word boundaries.  The code for the pad option is 0, and its length is
   1 octet.

    Code
   +-----+
   |  0  |



S. Alexander, R. Droms     Expires June 1993                    [Page 2]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+

   2.2. End Option

   The end option marks the end of valid information in the vendor
   field.  Subsequent octets should be filled with pad options.  The
   code for the end option is 255, and its length is 1 octet.

    Code
   +-----+
   | 255 |
   +-----+

   2.3. Subnet Mask

   The subnet mask option specifies the local subnet mask as per RFC 950
   [4].  The code for the subnet mask option is 1, and its length is 4
   octets.

   If both the subnet mask and the router option are specified in a DHCP
   reply, the subnet mask option MUST be first.

    Code        Subnet Mask
   +-----+-----+-----+-----+-----+
   |  1  |  m1 |  m2 |  m3 |  m4 |
   +-----+-----+-----+-----+-----+

   2.4. Time Offset

   The time offset field specifies the offset of the local subnet in
   seconds from Coordinated Universal Time (UTC).  The offset is
   expressed as a signed 32-bit integer.  The code for the time offset
   option is 2, and its length is 4 octets.

    Code        Time Offset
   +-----+-----+-----+-----+-----+
   |  2  |  n1 |  n2 |  n3 |  n4 |
   +-----+-----+-----+-----+-----+

   2.5. Router Option

   The router option specifies a list of IP addresses for routers on the
   local subnet.  If one of the routers is preferred, it SHOULD be
   listed first. The code for the router option is 3.  The minimum
   length for the router option is 4 octets, and the length MUST always
   be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  3  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...



S. Alexander, R. Droms     Expires June 1993                    [Page 3]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.6. Time Server Option

   The time server option specifies a list of RFC 868 [5] time servers
   on the local subnet.  If one of the servers is preferred, it SHOULD
   be listed first. The code for the time server option is 4.  The
   minimum length for this option is 4 octets, and the length MUST
   always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  4  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.7. Name Server Option

   The name server option specifies a list of IEN 116 [6] name servers
   on the local subnet.  If one of the servers is preferred, it SHOULD
   be listed first. The code for the name server option is 5.  The
   minimum length for this option is 4 octets, and the length MUST
   always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  5  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.8. Domain Name Server Option

   The domain name server option specifies a list of Domain Name System
   (RFC 1035 [7]) name servers on the local subnet.  If one of the
   servers is preferred, it SHOULD be listed first. The code for the
   domain name server option is 6.  The minimum length for this option
   is 4 octets, and the length MUST always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  6  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.9. Log Server Option

   The log server option specifies a list of MIT-LCS UDP log servers on
   the local subnet.  If one of the servers is preferred, it SHOULD be
   listed first. The code for the log server option is 7.  The minimum
   length for this option is 4 octets, and the length MUST always be a
   multiple of 4.

    Code   Len         Address 1               Address 2



S. Alexander, R. Droms     Expires June 1993                    [Page 4]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  7  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.10. Cookie Server Option

   The cookie server option specifies a list of RFC 865 [8] cookie
   servers on the local subnet.  If one of the servers is preferred, it
   SHOULD be listed first. The code for the log server option is 8.  The
   minimum length for this option is 4 octets, and the length MUST
   always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  8  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.11. LPR Server Option

   The LPR server option specifies a list of RFC 1179 [9] line printer
   servers on the local subnet.  If one of the servers is preferred, it
   SHOULD be listed first. The code for the LPR server option is 9.  The
   minimum length for this option is 4 octets, and the length MUST
   always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  9  |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.12. Impress Server Option

   The Impress server option specifies a list of Imagen Impress servers
   on the local subnet.  If one of the servers is preferred, it SHOULD
   be listed first. The code for the Impress server option is 10.  The
   minimum length for this option is 4 octets, and the length MUST
   always be a multiple of 4.

    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  10 |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.13. Resource Location Server Option

   This option specifies a list of RFC 887 [10] Resource Location
   servers on the local subnet.  If one of the servers is preferred, it
   SHOULD be listed first. The code for this option is 11.  The minimum
   length for this option is 4 octets, and the length MUST always be a
   multiple of 4.



S. Alexander, R. Droms     Expires June 1993                    [Page 5]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  11 |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.14. Host Name Option

   This option specifies the name of the DHCP client.  The name may or
   may not be qualified with the local domain name.  See RFC 1035 for
   character set restrictions.  The code for this option is 12, and its
   minimum length is 1.

    Code   Len                 Host Name
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  12 |  n  |  h1 |  h2 |  h3 |  h4 |  h5 |  h6 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   2.15. Boot File Size Option

   This option specifies the length in 512-octet blocks of the default
   boot image for the DHCP client.  The file length is specified as an
   unsigned 16-bit integer.  The code for this option is 13, and its
   length is 2.

    Code   Len   File Size
   +-----+-----+-----+-----+
   |  13 |  2  |  l1 |  l2 |
   +-----+-----+-----+-----+

3. IP Layer Parameters per Host

   This section details the options that affect the operation of the IP
   layer on a per-host basis.

   3.1. IP Forwarding Enable/Disable Option

   This option specifies whether the DHCP client should configure its IP
   layer for packet forwarding.  A value of 0 means disable IP
   forwarding, and a value of 1 means enable IP forwarding.  The code
   for this option is 20, and its length is 1.

    Code   Len  Value
   +-----+-----+-----+
   |  20 |  1  | 0/1 |
   +-----+-----+-----+

   3.2. Non-Local Source Routing Enable/Disable Option

   This option specifies whether the DHCP client should configure its IP
   layer to allow forwarding of datagrams with non-local source routes.



S. Alexander, R. Droms     Expires June 1993                    [Page 6]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   A value of 0 means disallow forwarding of such datagrams, and a value
   of 1 means allow forwarding.  The code for this option is 21, and its
   length is 1.

    Code   Len  Value
   +-----+-----+-----+
   |  21 |  1  | 0/1 |
   +-----+-----+-----+

   3.3. Policy Filter Option

   This option specifies policy filters for non-local source routing.
   The filters consist of a list of IP addresses and masks which specify
   destination/mask pairs with which to filter incoming source routes.
   See RFC 1009 [11] for details.

   The code for this option is 22.  The minimum length of this option is
   8, and the length MUST be a multiple of 8.

    Code   Len         Address 1                  Mask 1
   +-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
   |  22 |  n  |  a1 |  a2 |  a3 |  a4 |  m1 |  m2 |  m3 |  m4 |
   +-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
           Address 2                  Mask 2
   +-----+-----+-----+-----+-----+-----+-----+-----+---
   |  a1 |  a2 |  a3 |  a4 |  m1 |  m2 |  m3 |  m4 | ...
   +-----+-----+-----+-----+-----+-----+-----+-----+---

   3.4. Maximum Datagram Reassembly Size

   This option specifies the maximum size datagram that the client
   should be prepared to reassemble.  The size is specified as a 16-bit
   unsigned integer.

   The code for this option is 23, and its length is 2.

    Code   Len      Size
   +-----+-----+-----+-----+
   |  23 |  2  |  s1 |  s2 |
   +-----+-----+-----+-----+

   3.5. Default IP Time-to-live

   This option specifies the default time-to-live that the client should
   use on outgoing datagrams.  The TTL is specified as an octet with a
   value between 1 and 255.

   The code for this option is 24, and its length is 1.

    Code   Len   TTL



S. Alexander, R. Droms     Expires June 1993                    [Page 7]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+-----+-----+
   |  24 |  1  | ttl |
   +-----+-----+-----+

   3.6. Path MTU Aging Timeout Option

   This option specifies the timeout to use when aging Path MTU values
   discovered by the mechanism defined in RFC 1191 [12].  The timeout is
   specified as a 32-bit unsigned integer.

   The code for this option is 25, and its length is 4.

    Code   Len           Timeout
   +-----+-----+-----+-----+-----+-----+
   |  25 |  4  |  t1 |  t2 |  t3 |  t4 |
   +-----+-----+-----+-----+-----+-----+

   3.7. Path MTU Plateau Table Option

   This option specifies a table of MTU sizes to use when performing
   Path MTU Discovery as defined in RFC 1191.  The table is formatted as
   a list of 16-bit unsigned integers, ordered from smallest to largest.
   The minimum MTU value cannot be smaller than 68.

   The code for this option is 26.  Its minimum length is 2, and the
   length MUST be a multiple of 2.

    Code   Len     Size 1      Size 2
   +-----+-----+-----+-----+-----+-----+---
   |  26 |  n  |  s1 |  s2 |  s1 |  s2 | ...
   +-----+-----+-----+-----+-----+-----+---

   3.8. Network Information Service Domain Option

   This option specifies the name of the client's NIS [13] domain.  The
   domain is formatted as a character string consisting of characters
   from the NVT ASCII character set.

   The code for this option is 56.  Its minimum length is 1.
    Code   Len      NIS Domain Name
   +-----+-----+-----+-----+-----+-----+---
   |  56 |  n  |  n1 |  n2 |  n3 |  s4 | ...
   +-----+-----+-----+-----+-----+-----+---

   3.9. Network Information Servers Option

   This option specifies a list of IP addresses indicating NIS servers
   on the local subnet.  If one address is preferred, it SHOULD be
   listed first.




S. Alexander, R. Droms     Expires June 1993                    [Page 8]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   The code for this option is 57.  Its minimum length is 4, and the
   length MUST be a multiple of 4..
    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  57 |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

   3.10. Network Time Protocol Servers Option

   This option specifies a list of IP addresses indicating NTP [14]
   servers on the local subnet.  If one address is preferred, it SHOULD
   be listed first.

   The code for this option is 58.  Its minimum length is 4, and the
   length MUST be a multiple of 4.
    Code   Len         Address 1               Address 2
   +-----+-----+-----+-----+-----+-----+-----+-----+--
   |  58 |  n  |  a1 |  a2 |  a3 |  a4 |  a1 |  a2 |  ...
   +-----+-----+-----+-----+-----+-----+-----+-----+--

4. IP Layer Parameters per Interface

   This section details the options that affect the operation of the IP
   layer on a per-interface basis.  It is expected that a DHCP client
   can issue multiple requests, one per interface, in order to configure
   interfaces with their specific parameters.

   4.1. Interface MTU Option

   This option specifies the MTU to use on this interface.  The MTU is
   specified as a 16-bit unsigned integer.  The minimum legal value for
   the MTU is 68.

   The code for this option is 29, and its length is 2.
    Code   Len      MTU
   +-----+-----+-----+-----+
   |  29 |  2  |  m1 |  m2 |
   +-----+-----+-----+-----+

   4.2. All Subnets are Local Option

   This option specifies whether or not the client can treat all subnets
   as having the local MTU.  A value of 0 indicates that the client
   should not treat subnets as being local for purposes of MTU
   computation.  A value of 1 means that the client may treat all
   subnets as being local.

   The code for this option is 30, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+



S. Alexander, R. Droms     Expires June 1993                    [Page 9]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   |  30 |  1  | 0/1 |
   +-----+-----+-----+

   4.3. Broadcast Address Option

   This option specifies whether or not the host portion of the
   broadcast address for this interface should be all ones or all
   zeroes.  A value of 0 indicates that the client should use zeroes
   (e.g. 128.212.64.0).  A value of 1 means that the client should use
   ones (e.g. 128.212.64.255).

   The code for this option is 31, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  31 |  1  | 0/1 |
   +-----+-----+-----+

   4.4. Perform Mask Discovery Option

   This option specifies whether or not the client should perform subnet
   mask discovery using ICMP.  A value of 0 indicates that the client
   should not perform mask discovery.  A value of 1 means that the
   client should perform mask discovery.

   The code for this option is 32, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  32 |  1  | 0/1 |
   +-----+-----+-----+

   4.5. Mask Supplier Option

   This option specifies whether or not the client should respond to
   subnet mask requests using ICMP.  A value of 0 indicates that the
   client should not respond.  A value of 1 means that the client should
   respond.

   The code for this option is 33, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  33 |  1  | 0/1 |
   +-----+-----+-----+

   4.6. Perform Router Discovery Option

   This option specifies whether or not the client should solicit
   routers using the Router Discovery mechanism defined in RFC 1256
   [15].  A value of 0 indicates that the client should not perform
   router discovery.  A value of 1 means that the client should perform
   router discovery.



S. Alexander, R. Droms     Expires June 1993                   [Page 10]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   The code for this option is 34, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  34 |  1  | 0/1 |
   +-----+-----+-----+

   4.7. Router Solicitation Address Option

   This option specifies the address to which the client should transmit
   router solicitation requests.

   The code for this option is 35, and its length is 4.
    Code   Len            Address
   +-----+-----+-----+-----+-----+-----+
   |  35 |  4  |  a1 |  a2 |  a3 |  a4 |
   +-----+-----+-----+-----+-----+-----+

   4.8. Static Route Option

   This option specifies a list of static routes that the client should
   install in its routing cache.  The routes consist of a list of IP
   address pairs.  The first address is the destination address, and the
   second address is the router to the destination.

   The code for this option is 37.  The minimum length of this option is
   8, and the length MUST be a multiple of 8.

    Code   Len         Destination 1           Router 1
   +-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
   |  37 |  n  |  d1 |  d2 |  d3 |  d4 |  r1 |  r2 |  r3 |  r4 |
   +-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+
           Destination 2           Router 2
   +-----+-----+-----+-----+-----+-----+-----+-----+---
   |  d1 |  d2 |  d3 |  d4 |  r1 |  r2 |  r3 |  r4 | ...
   +-----+-----+-----+-----+-----+-----+-----+-----+---

5. Link Layer Parameters per Interface

   This section lists the options that affect the operation of the data
   link layer on a per-interface basis.

   5.1. Trailer Encapsulation Option

   This option specifies whether or not the client should negotiate the
   use of trailers [16] when using the ARP protocol.  A value of 0
   indicates that the client should not attempt to use trailers.  A
   value of 1 means that the client should attempt to use trailers.

   The code for this option is 38, and its length is 1.
    Code   Len  Value



S. Alexander, R. Droms     Expires June 1993                   [Page 11]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+-----+-----+
   |  38 |  1  | 0/1 |
   +-----+-----+-----+

   5.2. ARP Cache Timeout Option

   This option specifies the timeout in seconds for ARP cache entries.
   The time is specified as a 32-bit unsigned integer.

   The code for this option is 39, and its length is 4.
    Code   Len           Time
   +-----+-----+-----+-----+-----+-----+
   |  39 |  4  |  t1 |  t2 |  t3 |  t4 |
   +-----+-----+-----+-----+-----+-----+

   5.3. Ethernet Encapsulation Option

   This option specifies whether or not the client should use Ethernet
   Version 2 (RFC 894 [17]) or IEEE 802.3 (RFC 1042 [18]) encapsulation
   if the interface is an Ethernet.  A value of 0 indicates that the
   client should use RFC 894 encapsulation.  A value of 1 means that the
   client should use RFC 1042 encapsulation.

   The code for this option is 40, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  40 |  1  | 0/1 |
   +-----+-----+-----+

6. TCP Parameters

   This section lists the options that affect the operation of the TCP
   layer on a per-interface basis.

   6.1. TCP Default TTL Option

   This option specifies the default TTL that the client should use when
   sending TCP segments.  The value is represented as an 8-bit unsigned
   integer.  The minimum value is 1.

   The code for this option is 41, and its length is 1.
    Code   Len   TTL
   +-----+-----+-----+
   |  41 |  1  |  n  |
   +-----+-----+-----+

   6.2. TCP Keepalive Interval Option

   This option specifies the interval that the client TCP should wait
   before sending a keepalive message on a TCP connection.  The time is



S. Alexander, R. Droms     Expires June 1993                   [Page 12]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   specified as a 32-bit unsigned integer.  A value of zero indicates
   that the client should not generate keepalive messages on connections
   unless specifically requested by an application.

   The code for this option is 42, and its length is 4.
    Code   Len           Time
   +-----+-----+-----+-----+-----+-----+
   |  42 |  4  |  t1 |  t2 |  t3 |  t4 |
   +-----+-----+-----+-----+-----+-----+

   6.3. TCP Keepalive Garbage Option

   This option specifies the whether or not the client should send TCP
   keepalive messages with a octet of garbage for compatibility with
   older implementations.  A value of 0 indicates that a garbage octet
   should not be sent. A value of 1 indicates that a garbage octet
   should be sent.

   The code for this option is 43, and its length is 1.
    Code   Len  Value
   +-----+-----+-----+
   |  43 |  1  | 0/1 |
   +-----+-----+-----+

7. DHCP Extensions

   This section details the options that are specific to DHCP.

   7.1. Requested IP Address

   This option is used in a client request (DHCPDISCOVER) to allow the
   client to request that a particular IP address be assigned.  In a
   server reply (DHCPOFFER), this option indicates the IP address that
   the server is willing to offer.

   The code for this option is 46, and its length is 4.
    Code   Len          Address
   +-----+-----+-----+-----+-----+-----+
   |  46 |  4  |  a1 |  a2 |  a3 |  a4 |
   +-----+-----+-----+-----+-----+-----+

   7.2. IP Address Lease Time

   This option is used in a client request (DHCPDISCOVER or DHCPREQUEST)
   to allow the client a lease time for the IP address.  In a server
   reply (DHCPOFFER), a DHCP server uses this option to specify the
   lease time it is willing to offer.

   The code for this option is 47, and its length is 4.
    Code   Len         Lease Time



S. Alexander, R. Droms     Expires June 1993                   [Page 13]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   +-----+-----+-----+-----+-----+-----+
   |  47 |  4  |  t1 |  t2 |  t3 |  t4 |
   +-----+-----+-----+-----+-----+-----+

   7.3. Option Overload

   This option is used to indicate that the DHCP "sname" or "file"
   fields are being overloaded by using them to carry DHCP options. A
   DHCP server inserts this option if the returned parameters will
   exceed the usual space allotted for options.

   If this option is present, the DHCP client interprets the specified
   additional fields after it concludes interpretation of the standard
   option fields.

   The code for this option is 48, and its length is 1.  Legal values
   for this option are:
           Value   Meaning
           -----   --------
             1     use the "file" field to hold options
             2     use the "sname" field to hold options
             3     use both fields to hold options

    Code   Len  Value
   +-----+-----+-----+
   |  48 |  1  |1/2/3|
   +-----+-----+-----+

   7.4. DHCP Message Type

   This option is used to convey the type of the DHCP message.  The code
   for this option is 51, and its length is 1.  Legal values for this
   option are:
           Value   Message Type
           -----   ------------
             1     DHCPDISCOVER
             2     DHCPOFFER
             3     DHCPREQUEST
             4     DHCPDECLINE
             5     DHCPACK
             6     DHCPNAK
             7     DHCPRELEASE

    Code   Len  Type
   +-----+-----+-----+
   |  51 |  1  | 1-7 |
   +-----+-----+-----+

   7.5. Lease Identifier Cookie




S. Alexander, R. Droms     Expires June 1993                   [Page 14]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   This option is used by a DHCP server to indicate the unique
   identifier for an address lease.  The cookie is an opaque object of n
   octets.  The cookie is used by the client to identify the lease in
   future protocol transactions.

   The code for this option is 52.
    Code   Len   Cookie Data
   +-----+-----+-----+-----+---
   |  52 |  n  |  c1 |  c2 | ...
   +-----+-----+-----+-----+---

   7.6. Server Identifier

   This option is used by a DHCP client to indicate which of several
   lease offers it is accepting.  The identifier is the IP address of
   the selected server.

   The code for this option is 53, and its length is 4.
    Code   Len            Address
   +-----+-----+-----+-----+-----+-----+
   |  53 |  4  |  a1 |  a2 |  a3 |  a4 |
   +-----+-----+-----+-----+-----+-----+

   7.7. Parameter Request Vector

   This option is used by a DHCP client to request values for specified
   configuration parameters.  The options are specified as a 32-octet
   bit vector, where each bit that is set indicates the the client is
   requesting a parameter for that option.  The order of bits in the
   vector is big-endian within octets.  This means that the bit for
   parameter code 0 is the left-most bit of the first octet.

   The code for this option is 54, and its length is 32.
    Code   Len   Bit Vector
   +-----+-----+-----+-----+---
   |  54 | 32  |  c1 |  c2 | ... 30 more octets ...
   +-----+-----+-----+-----+---

   7.8. Parameter Request List

   This option is used by a DHCP client to request values for specified
   configuration parameters.  The list of requested parameters is
   specified as n octets, where each octet is a valid DHCP option code
   as defined in this document.  The client may order the option codes
   as it desires.  The DHCP server is not required to return the options
   in the requested order.

   The code for this option is 55.
    Code   Len   Option Codes
   +-----+-----+-----+-----+---



S. Alexander, R. Droms     Expires June 1993                   [Page 15]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   |  55 |  n  |  c1 |  c2 | ...
   +-----+-----+-----+-----+---

   7.9. Message

   This option is used by a DHCP server to provide an error message to a
   DHCP client in the event of a failure. The message consists of n
   octets of NVT ASCII text, which the client may display on an
   available output device.

   The code for this option is 59.
    Code   Len     Text
   +-----+-----+-----+-----+---
   |  59 |  n  |  c1 |  c2 | ...
   +-----+-----+-----+-----+---

   7.10. Maximum DHCP Message Size

   This option specifies the maximum length DHCP message that it is
   willing to accept.  The length is specified as an unsigned 16-bit
   integer.  The code for this option is 60, and its length is 2.  The
   minimum legal value is 267 octets (264 octets for the DHCP header + 3
   octets for the DHCP message type).
    Code   Len     Length
   +-----+-----+-----+-----+
   |  60 |  2  |  l1 |  l2 |
   +-----+-----+-----+-----+

8. Security Considerations

   Security considerations are not addressed in this memo.

9. References

   [1] Droms, R., "Dynamic Host Configuration Protocol", Internet Draft,
       August 1992.

   [2] Reynolds, J.K., "BOOTP Vendor Information Extensions", RFC 1084,
       December 1988.

   [3] Braden, R.T., "Requirements for Internet Hosts - Communication
       Layers", RFC 1122,November 1989.
   [4]

       Mogul, J., "Internet Standard Subnetting Procedure", RFC 950,
       August 1985.
   [5] Postel, J.B., and K. Harrenstien, "Time Protocol", RFC 868, May
       1983.

   [6] Postel, J.B., "Name Server", IEN 116, August 1979.



S. Alexander, R. Droms     Expires June 1993                   [Page 16]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   [7] Mockapetris, P.V., "Domain Names - Implementation and
       Specification", RFC 1035, November 1987.

   [8] Postel, J.B., "Quote of the Day Protocol", RFC 865, May 1983.

   [9] McLaughlin, L., "Line Printer Daemon Protocol", RFC 1179, August
       1990.

  [10] Accetta, M., "Resource Location Protocol", RFC 887, December
       1983.

  [11] Braden, R.T. and J.B. Postel, "Requirements for Internet
       Gateways", RFC 1009, June 1987.

  [12] Mogul, J. and S. Deering, "Path MTU Discovery", RFC 1191,
       November 1990.

  [13] Sun Microsystems, "System and Network Administration", March
       1990.

  [14] Mills, D.L., "Internet Time Synchronization: The Network Time
       Protocol", RFC 1129,November 1989.

  [15] Deering, S.E., "ICMP Router Discovery Messages", RFC 1256,
       September 1991.

  [16] Leffler, S. and M.J. Karels, "Trailer Encapsulations", RFC 893,
       April 1984.

  [17] Hornig, C, "Standard for the Transmission of IP Datagrams over
       Ethernet Networks", RFC 894, April 1984.

  [18] Postel, J.B. and J.K. Reynolds, "Standard for the Transmission of
       IP Datagrams Over IEEE 802 Networks", RFC 1042, February 1988.

10. Authors' Address

   Steve Alexander
   INTERACTIVE Systems Corporation
   1901 North Naper Boulevard
   Naperville, IL 60563-8895

   Phone: (708) 505-9100 x256
   EMail: stevea@isc.com

   Ralph Droms
   Computer Science Department
   323 Dana Engineering
   Bucknell University
   Lewisburg, PA 17837



S. Alexander, R. Droms     Expires June 1993                   [Page 17]

Internet-Draft  DHCP Options and BOOTP Vendor Extensions   November 1992


   Phone: (717) 524-1145
   EMail: droms@bucknell.edu



















































S. Alexander, R. Droms     Expires June 1993                   [Page 18]

